# Homework w05d03 -  more sql

We are going to be using the northwind database.

psql -h dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com -p 5432 -U dsi_student northwind
password: gastudents

#### 1 . Search the web for 5 different psql shortcuts and use them on the northwind, what's the output? Describe each shortcut and its functionality.

\C [New table name] Change table Title

\conninfo : displays information about the current database connection. 

\da list of aggregate functions

\dn list schema

\dD lists domains

\df lists functions

\dg  list of groups

\di lists all sequences/joins

\dn  list of schemas

\dp lists table access privileges

\ds lists all system tables

\dt  list of datatypes

\dt lists all tables

\du lists users

\dv lists all views

\d+ list tables, views, and sequences

\d[S+] NAME describe table, view, sequence, or index

\e [FILE] [LINE] edit the query buffer (or file) with external editor

\h [SQL Command] : displays help on SQL command, e.g. \h UPDATE, \h CREATE TABLE, etc. 

\i execute commands from file

\l lists all databases

\o FILE_NAME : send a query result and write it into a file  

\p : displays the command in the query buffer (i.e. the last SQL query in the memory stack) 

\q: quit

\r: resets the query buffer

\s [ filename ]: print command line history to filename

\x change to list view

\z   list access privileges

\? Enquire psql command

#### 2 . Now we will query the northwind db directly. Remember to LIMIT on the queries and leave the output of the queries in the cell.

In [1]:
%load_ext sql

In [2]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
select * from orders limit 10;

10 rows affected.

[(10248, u'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, u'Vins et alcools Chevalier', u"59 rue de l'Abbaye", u'Reims', None, u'51100', u'France'),
 (10249, u'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, u'Toms Spezialit\xe4ten', u'Luisenstr. 48', u'M\xfcnster', None, u'44087', u'Germany'),
 (10250, u'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, u'Hanari Carnes', u'Rua do Pa\xe7o, 67', u'Rio de Janeiro', u'RJ', u'05454-876', u'Brazil'),
 (10251, u'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, u'Victuailles en stock', u'2, rue du Commerce', u'Lyon', None, u'69004', u'France'),
 (10252, u'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, u'Supr\xeames d\xe9lices', u'Boulevard Tirou, 255', u'Charleroi', None, u'B-6000', u'Belgium'),
 (10253, u'HANAR', 3, datetime.date(1996, 7, 10), datetime.date(1996, 7, 24), datetime.date(1996, 7, 16), 2, 58.17, u'Hanari Carnes', u'Rua do Pa\xe7o, 67', u'Rio de Janeiro', u'RJ', u'05454-876', u'Brazil'),
 (10254, u'CHOPS', 5, datetime.date(1996, 7, 11), datetime.date(1996, 8, 8), datetime.date(1996, 7, 23), 2, 22.98, u'Chop-suey Chinese', u'Hauptstr. 31', u'Bern', None, u'3012', u'Switzerland'),
 (10255, u'RICSU', 9, datetime.date(1996, 7, 12), datetime.date(1996, 8, 9), datetime.date(1996, 7, 15), 3, 148.33, u'Richter Supermarkt', u'Starenweg 5', u'Gen\xe8ve', None, u'1204', u'Switzerland'),
 (10256, u'WELLI', 3, datetime.date(1996, 7, 15), datetime.date(1996, 8, 12), datetime.date(1996, 7, 17), 2, 13.97, u'Wellington Importadora', u'Rua do Mercado, 12', u'Resende', u'SP', u'08737-363', u'Brazil'),
 (10257, u'HILAA', 4, datetime.date(1996, 7, 16), datetime.date(1996, 8, 13), datetime.date(1996, 7, 22), 3, 81.91, u'HILARION-Abastos', u'Carrera 22 con Ave. Carlos Soublette #8-35', u'San Crist\xf3bal', u'T\xe1chira', u'5022', u'Venezuela')]

In [3]:
%%sql
SELECT * FROM information_schema.tables WHERE table_schema = 'public';

19 rows affected.

[(u'northwind', u'public', u'categories', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'customercustomerdemo', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'customerdemographics', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'customers', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'employees', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'employeeterritories', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'order_details', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'orders', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'products', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'region', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'shippers', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'shippers_tmp', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'suppliers', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'territories', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'usstates', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'table1', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'movies', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'ratings', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None),
 (u'northwind', u'public', u'categoriesmerged', u'BASE TABLE', None, None, None, None, None, u'YES', u'NO', None)]

#### 3 . Build a query using ORDER BY

In [4]:
%%sql
SELECT "CustomerID","ShipAddress","RequiredDate" FROM orders ORDER BY 3 LIMIT 5;

5 rows affected.

[(u'HANAR', u'Rua do Pa\xe7o, 67', datetime.date(1996, 7, 24)),
 (u'VINET', u"59 rue de l'Abbaye", datetime.date(1996, 8, 1)),
 (u'HANAR', u'Rua do Pa\xe7o, 67', datetime.date(1996, 8, 5)),
 (u'VICTE', u'2, rue du Commerce', datetime.date(1996, 8, 5)),
 (u'SUPRD', u'Boulevard Tirou, 255', datetime.date(1996, 8, 6))]

In [5]:
%%sql 
SELECT "ShipName","Freight" FROM orders ORDER BY "Freight" DESC LIMIT 5;

5 rows affected.

[(u'QUICK-Stop', 1007.64),
 (u'Queen Cozinha', 890.78),
 (u'Save-a-lot Markets', 830.75),
 (u'QUICK-Stop', 810.05),
 (u'Ernst Handel', 789.95)]

#### 4 . Build a query using using aliasin (AS)

In [6]:
%%sql
SELECT "ShipCountry" AS "Country", "CustomerID" AS "Customer" FROM orders LIMIT 5;

5 rows affected.

[(u'France', u'VINET'),
 (u'Germany', u'TOMSP'),
 (u'Brazil', u'HANAR'),
 (u'France', u'VICTE'),
 (u'Belgium', u'SUPRD')]

In [10]:
%%sql 
SELECT "ShipCountry", COUNT(*) as count_per_country 
FROM orders 
GROUP BY "ShipCountry"
Limit 5;

5 rows affected.

[(u'Austria', 40L),
 (u'Germany', 122L),
 (u'Venezuela', 46L),
 (u'Poland', 7L),
 (u'France', 77L)]

#### 5 . Build a query using LIKE

In [10]:
%%sql
SELECT "ShipName" AS "Ship" FROM orders WHERE "ShipName" LIKE '% et %' LIMIT 5;

5 rows affected.

[(u'Vins et alcools Chevalier',),
 (u'Blondel p\xe8re et fils',),
 (u'Vins et alcools Chevalier',),
 (u'Vins et alcools Chevalier',),
 (u'Blondel p\xe8re et fils',)]

In [39]:
%%sql 
SELECT "ShipAddress","ShipCity" FROM orders WHERE "ShipAddress" LIKE '%rue%' LIMIT 5;

5 rows affected.

[(u"59 rue de l'Abbaye", u'Reims'),
 (u'2, rue du Commerce', u'Lyon'),
 (u"59 rue de l'Abbaye", u'Reims'),
 (u"59 rue de l'Abbaye", u'Reims'),
 (u'67, rue des Cinquante Otages', u'Nantes')]

#### 6 . Build a query using DISTINCT

In [40]:
%%sql
SELECT DISTINCT "ShipAddress" AS "Unique ship addresses" FROM orders LIMIT 5;

5 rows affected.

[(u'24, place Kl\xe9ber',),
 (u'2817 Milton Dr.',),
 (u'89 Jefferson Way Suite 2',),
 (u'City Center Plaza 516 Main St.',),
 (u'Rua do Mercado, 12',)]

In [41]:
%%sql
SELECT DISTINCT "EmployeeID","CustomerID"
FROM orders LIMIT 5;

5 rows affected.

[(3, u'DRACD'), (1, u'HILAA'), (8, u'LONEP'), (1, u'SPLIR'), (7, u'FAMIA')]

#### 7 . Build a query using GROUP BY

In [46]:
%%sql
SELECT "ProductID", AVG("Discount") FROM order_details GROUP BY 1 ORDER BY 2 DESC LIMIT 5;

5 rows affected.

[(48, 0.108333336810271),
 (2, 0.102272728712044),
 (9, 0.100000001490116),
 (58, 0.100000001283156),
 (25, 0.0861111119803455)]

In [47]:
%%sql
SELECT "ShipCountry", "ShipCity", COUNT(*) FROM orders
GROUP BY 1, 2
ORDER BY 1, 3 DESC
LIMIT 5;

5 rows affected.

[(u'Argentina', u'Buenos Aires', 16L),
 (u'Austria', u'Graz', 30L),
 (u'Austria', u'Salzburg', 10L),
 (u'Belgium', u'Charleroi', 12L),
 (u'Belgium', u'Bruxelles', 7L)]

In [51]:
%%sql
SELECT "ShipCountry", "ShipCity" FROM orders
GROUP BY 1, 2
LIMIT 10;

10 rows affected.

[(u'Germany', u'M\xfcnster'),
 (u'Germany', u'Mannheim'),
 (u'Germany', u'Berlin'),
 (u'Germany', u'Leipzig'),
 (u'Switzerland', u'Gen\xe8ve'),
 (u'Norway', u'Stavern'),
 (u'Finland', u'Oulu'),
 (u'France', u'Nantes'),
 (u'USA', u'Lander'),
 (u'Sweden', u'Br\xe4cke')]

#### 8 . Build a query using HAVING

In [48]:
%%sql

SELECT "CustomerID", "ShipCity", AVG("UnitPrice") 
FROM orders 
JOIN order_details USING ("OrderID") 
GROUP BY 1,2 
HAVING AVG("UnitPrice")>25 
LIMIT 5;

5 rows affected.

[(u'GOURL', u'Campinas', 25.6147367577804),
 (u'GROSR', u'Caracas', 41.3874998092651),
 (u'LONEP', u'Portland', 31.2642856325422),
 (u'OLDWO', u'Anchorage', 28.7083334128062),
 (u'WHITC', u'Seattle', 31.9582499027252)]

In [45]:
%%sql 
SELECT "ShipCity", COUNT(*) as count FROM orders 
GROUP BY "ShipCity" 
HAVING (Count(*) > 20) 
ORDER BY count ASC LIMIT 5;

5 rows affected.

[(u'Cunewalde', 28L),
 (u'M\xe9xico D.F.', 28L),
 (u'Graz', 30L),
 (u'Boise', 31L),
 (u'Sao Paulo', 31L)]

In [49]:
%%sql
SELECT "OrderID", SUM("Quantity" * "UnitPrice") AS "sum_x" FROM order_details
GROUP BY "OrderID"
HAVING SUM("Quantity" * "UnitPrice") > 11000
ORDER BY 1
LIMIT 5;

5 rows affected.

[(10372, 12281.2001800537),
 (10417, 11283.2001399994),
 (10424, 11493.2001266479),
 (10817, 11490.6999397278),
 (10865, 17250.0)]